'use strict';
class StatsService {
    constructor(){
        this.headers = ["Ділай","Маюн","Мельничук","Сікорський","Чикуров","Шарга", "Тремпольцева", "Балишин", "Гундарцев"];
        this.data = [
            ["+50", "-50", "", "+50", "", "", "", "-50", ""],
            ["", "", "-25", "+25", "+25", "-25", "", "", ""],
            ["+25", "-25", "", "+25", "", "-25", "", "", ""],
            ["+25", "", "", "+25", "-25", "-25", "", "", ""],
            ["+25", "", "", "", "+25", "", "-25", "", "-25"]
        ]
    }

    list(){
        return this.data;
    }

    headersList() {
        return this.headers;
    }
}
module.exports = new StatsService();


